[
    [
        {
            "name": "Bench Press",
            "steps": [
                "Lay flat on the bench with your feet on the ground. With straight arms unrack the bar.",
                "Lower the bar to your mid chest",
                "Raise the bar until you've locked your elbows."
            ],
            "video": "https://media.musclewiki.com/media/uploads/videos/branded/male-barbell-bench-press-front.mp4"
        },
        {
            "name": "Push Up",
            "steps": [
                "Place your hands firmly on the ground, directly under shoulders.",
                "Flatten your back so your entire body is straight and slowly lower your body",
                "Draw shoulder blades back and down, keeping elbows tucked close to your body",
                "Exhale as you push back to the starting position."
            ],
            "video": "https://media.musclewiki.com/media/uploads/videos/branded/male-bodyweight-pushup-front.mp4#t=0.1"
        }
    ],
    [
        {
            "name": "Deadlift",
            "steps": [
                "Stand with a barbell at your shins with your feet shoulder width apart.",
                "Bend forward at your hips and keep your knees as fully extended as possible.",
                "Grab the barbell and then extend your hips while maintaining a straight back.",
                "From the standing position, lower the weight in a controlled manner.",
                "You can either lower the weight to the floor or before you touch the floor, depending on your mobility."
            ],
            "video": "https://media.musclewiki.com/media/uploads/videos/branded/male-barbell-stiff-leg-deadlift-front.mp4#t=0.1"
        },
        {
            "name": "Pull Up",
            "steps": [
                "Grasp the bar with an overhand grip, arms and shoulders fully extended.",
                "Pull your body up until your chin is above the bar.",
                "Lower your body back to starting position."
            ],
            "video": "https://media.musclewiki.com/media/uploads/videos/branded/male-bodyweight-pullup-front.mp4#t=0.1"
        }
    ],
    [
        {
            "name": "Squat",
            "steps": [
                "Stand with your feet shoulder width apart.",
                "Flex your knees and hips and sit back into the squat while lowering your body",
                "Continue down to full depth",
                "Return to starting position.",
                "You can either lower the weight to the floor or before you touch the floor, depending on your mobility."
            ],
            "video": "https://musclewiki.com/barbell/male/glutes/barbell-squat"
        },
        {
            "name": "Pull Up",
            "steps": [
                "Step forward with one leg.",
                "Lower your body until your rear knee nearly touches the ground.",
                "Ensure you remain upright, and your front knee stay above the front foot.",
                "    Push off the floor with your front foot until you return to the starting position. Switch legs."
            ],
            "video": "https://media.musclewiki.com/media/uploads/videos/branded/male-bodyweight-forward-lunge-front.mp4#t=0.1"
        }
    ]
]